Tekla.Structures.Model.Grid.Insert
Inserts the grid into the model.
Returns: True on success.

Tekla.Structures.Model.Grid.Select
Selects the grid with the given ID.
Returns: True on success.

Tekla.Structures.Model.Grid.Modify
Modifies the grid with the given ID.
Returns: True on success.

Tekla.Structures.Model.Grid.Delete
Deletes the grid with the given ID.
Returns: True on success.

Tekla.Structures.Model.Grid.Name
The name of the grid.

Tekla.Structures.Model.Grid.IsMagnetic
Determines whether the grid is magnetic or not.

Tekla.Structures.Model.Grid.Color
Determines the color of the grid. This works only in wireframe views.
The color of grids in rendered views can be changed using the advanced option XS_GRID_COLOR.